# 리스트 기초

# ===========================================================
#  컬렉션 자료형: 리스트, 튜플, 딕셔너리, 집합
# ===========================================================

# ===========================================================
#  리스트 (list): 여러 객체를 순서가 있는 컬렉션으로 묶어 저장하는{{{ 변경 가능한 }}}자료형
#  리스트 특징
#  1. mutable, 변경 가능 -> 문자열과의 차이점
#  2. iterable, 반복 가능
#  3. sequence, 인덱싱과 슬라이싱 가능
#  4. 중복 가능
# ===========================================================

# 리스트 생성
a = []
b = list()
print(type(a), type(b))

a = [1, 3.14, True, "PYthon"] # 자료형이 달라도 된다!!
print(a)

s = "Python"
print(list(s)) # => 바로 문자열과 숫자를 배열로

print(list(range(10))) #? 0부터 9까지

# ===========================================================
# 1. 리스트는 mutable하다. (변경 가능)
# ===========================================================

a[0] = 10
a[-1] = "C"
print(a)


# ===========================================================
# 2. 리스트는 iterable하다. (반복 가능)
# ===========================================================

# 리스트 순회
for data in a: 
    print(data) # => 리스트를 순서대로 출력

for i, data in enumerate(a): #! enumerate: 인덱스와 값을 같이 리턴
    print(i, data)

# ===========================================================
# 3. 리스트는 sequence 자료형이다. (인덱싱, 슬라이싱 가능)
# ===========================================================

# 인덱싱
print(a[0])
print(a[-1])

# 슬라이싱
print(a[:2])
print(a[1:3])
print(a[::-1])

# ===========================================================
# 4. 리스트는 중복을 허용한다. (같은 값을 여러번 담을 수 있음)
# ===========================================================

a = [10, 10, 10, 10]
print(a)


# ===========================================================
#  파이썬 내장 함수
# ===========================================================

a = [3, 4, 1, 5, 2]

print(len(a)) # 길이
print(sum(a)) # 합
print(max(a)) # 최댓값
print(min(a)) # 최솟값

print(id(a))
b = sorted(a)# 오름차순 정렬 
print(id(b))
print(sorted(a, reverse = True))

# 리스트 합치기
print(a + [10, 20]) #//[3, 4, 1, 5, 2, 10, 20]
#! print(a + 10) -> 에러


# "+" 연산은 문자열과 동일하게 새로운 리스트 객체를 만듦
# 원본을 바꾸려면 리스트 메소드 사용하기
a.extend([30, 40])
print(a) #//[3, 4, 1, 5, 2, 30, 40]

a.append([50, 60]) # => 리스트를 풀지 않고 통째로
print(a) #//[3, 4, 1, 5, 2, 30, 40, [50, 60]]

a.insert(2, [70, 80]) # 특정 인덱스에 풀지 않고 통째로
print(a) #//[3, 4, [70, 80], 1, 5, 2, 30, 40, [50, 60]]

# 리스트 반복하기
print(a * 2) 
#//[3, 4, [70, 80], 1, 5, 2, 30, 40, [50, 60], 3, 4, [70, 80], 1, 5, 2, 30, 40, [50, 60]]

# 멤버십 연산자