# 집합 기초

# ===========================================================
#  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형
#  집합의 특징
#  1. mutable, 변경 가능 
#  2. iterable, 반복 가능
#  3. sequence 객체가 아니다, 인덱싱, 슬라이싱 불가
#  4. 중복을 허용하지 않는다
# ===========================================================

# 집합 생성
# a = {} # 딕셔너리
a = set() 
print(type(a)) # <class 'set'>

a = {3, 3, 3, 2, 2, 1}
print(a) # {1, 2, 3} >> 중복 제거

b = {100, 8, 30}
print(b) # {8, 100, 30} 
#! 8로 나눈 나머지가 작은 순서대로 (0, 3, 6)

# ===========================================================
# 1. 집합은 mutable하다. (변경 가능)
# ===========================================================

a.update({3, 4}) # 원본 변경
print(a) # {1, 2, 3, 4}

a.remove(3)  # 요소 제거 , 원본 변경
a.pop()  # 무작위로 요소를 제거하고 반환
print(a)  #// {1, 2, 3}



# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회
for x in a:
    print(x) #// 1, 2, 3


# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================

# a[0] = 100 #! 에러


# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {10, 10, 20, 20, 30}
print(s) # {10, 20, 30} >> 중복 제거

# ===========================================================
#  파이썬 내장 함수
# ===========================================================

print(len(s)) # 3
print(sum(s)) # 60
print(max(s)) # 30
print(min(s)) # 10
print(sorted(s)) # [10, 20, 30] >> 리스트

# 집합 합치기
s2 = {40, 50}
# print(s + s2) #! 에러
print(s.union(s2)) # {40, 10, 50, 20, 30} >> 합집합 , 언본 그대로 >> 새로운 set 리턴

# 집합 반복하기
# print(s * 2)

# 멤버십 연산자
print(10 in s)
print(1 in s)